Revit 2027 API
BoundingBoxXYZ.Enabled Property
Defines whether the entire bounding box is enabled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
public:
property bool Enabled {
	bool get ();
	void set (bool value);
}
member Enabled : bool with get, set
Property Value
Boolean
Remarks
A disabled bounding box might be used to signal that the corresponding Revit functionality is deactivated. For example, a disabled 3D view section box represents an inactive section box.
See Also
Reference
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace